export const userAgreementText = `版本发布时间：2021年12月15日
尊敬的用户，在您下载麦塔校园小程序（下称“小程序”）、手机应用程序（下称“APP”）使用麦塔校园的服务前，请仔细阅读本用户协议。
本协议是您与“麦塔校园”及其关联方（以下统称“麦塔校园”）签署的《用户协议》。您通过小程序、下载APP或其他渠道成功注册并使用小程序、APP，即被视为您已阅读、理解、接受本协议的全部条款。本协议以及上述相关协议所涉内容可由麦塔校园不时作出修订，修订后的内容一旦以任何形式在小程序、APP上公布即生效，并取代此前的内容。您知悉并确认，如您不同意本协议及相关协议或其修订版本，则应立即停止使用小程序、APP；如您继续使用，则视为您同意接受相关条款及其修订内容。
如果您不满十八（18）周岁，您应与您的父母或监护人共同阅读本协议，确保您及您的父母或监护人理解并同意本协议的内容。
一、总则
1.1　用户应当同意本协议的条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中勾选"我已阅读并接受"模块即表示用户与麦塔校园达成协议，完全接受本协议项下的全部条款。
1.2　用户注册成功后，麦塔校园将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
1.3　用户可以使用麦塔校园各个模块单项服务，当用户使用麦塔校园各单项服务时，用户的使用行为视为其对该单项服务的服务条款以及麦塔校园在该单项服务中发出的各类公告的同意。
二、注册信息和隐私保护
2.1　麦塔校园帐号（即麦塔校园用户ID）的所有权归麦塔校园，用户完成注册申请后，获得麦塔校园帐号的使用权。所有原始键入的资料将引用为注册资料。如果因注册信息不真实而引起的问题，以及对问题发生所带来的后果，麦塔校园不负任何责任。
2.2　用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知麦塔校园。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，麦塔校园不承担任何责任。
2.3　麦塔校园不对外公开或向第三方提供单个用户的注册资料，除非：
• 事先获得用户的明确授权；
• 只有透露您的个人资料，才能提供您所要求的产品和服务；
• 根据有关的法律法规要求；
• 按照相关政府主管部门的要求；
• 为维护麦塔校园的合法权益。
2.4　在您注册麦塔校园，使用其他麦塔校园产品或服务，访问麦塔校园网页时，麦塔校园会收集您的个人身份识别资料，并会将这些资料用于：改进为您提供的服务及网页内容。
三、使用规则
3.1　用户在使用麦塔校园服务时，必须遵守中华人民共和国相关法律法规的规定，用户应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶
（1）上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：
1）反对宪法所确定的基本原则的；
2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
3）损害国家荣誉和利益的；
4）煽动民族仇恨、民族歧视、破坏民族团结的；
5）破坏国家宗教政策，宣扬邪教和封建迷信的；
6）散布谣言，扰乱社会秩序，破坏社会稳定的；
7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
8）侮辱或者诽谤他人，侵害他人合法权利的；
9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
10）以非法民间组织名义活动的；
含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
11）
12)侵犯他人知识产权或其他合法权益的；
13）含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
（2）不得为任何非法目的而使用网络服务系统；
（3）不利用麦塔校园服务从事以下活动：
1）未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
2）未经允许，对计算机信息网络功能进行删除、修改或者增加的；
3）未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
4）故意制作、传播计算机病毒等破坏性程序的；
5）其他危害计算机信息网络安全的行为。
3.2　用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失（包括律师费等合理费用），您同意赔偿麦塔校园与合作公司、关联公司，并使之免受损害。对此，麦塔校园有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收麦塔校园帐号、追究法律责任等措施。对恶意注册麦塔校园帐号或利用麦塔校园帐号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，麦塔校园有权回收其帐号。同时，麦塔校园会视司法部门的要求，协助调查。
3.3　用户不得对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。
3.4　用户须对自己在使用麦塔校园服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在麦塔校园首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予麦塔校园等额的赔偿及因此造成的损失（包括律师费等合理费用）。
四、服务内容
4.1　麦塔校园网络服务的具体内容由麦塔校园根据实际情况提供。
4.2　除非您与麦塔校园另有约定，您同意本服务仅为您个人非商业性质的使用。
4.3　麦塔校园的部分服务是以收费方式提供的，如您使用收费服务，请遵守相关的协议。
4.4　麦塔校园可能根据实际需要对收费服务的收费标准、方式进行修改和变更，麦塔校园也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，麦塔校园将在相应服务页面进行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。
4.5　麦塔校园需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务（包括收费网络服务）在合理时间内的中断，麦塔校园无需为此承担任何责任。麦塔校园保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。
4.6　本服务或第三人可提供与其它国际互联网上之网站或资源之链接。由于麦塔校园无法控制这些网站及资源，您了解并同意，此类网站或资源是否可供利用，麦塔校园不予负责，存在或源于此类网站或资源之任何内容、广告、产品或其它资料，麦塔校园亦不予保证或负责。因使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、商品或服务所产生的任何损害或损失，麦塔校园不承担任何责任。
4.7　麦塔校园对在服务网上得到的任何商品购物服务、交易进程、招聘信息等都不作任何担保，由具体提供服务的个人/企业为您提供保障。
4.8　麦塔校园有权于任何时间暂时或永久修改或终止本服务（或其任何部分），而无论其通知与否，麦塔校园对用户和任何第三人均无需承担任何责任。
4.9　终止服务
您同意麦塔校园得基于其自行之考虑，因任何理由，包含但不限于麦塔校园认为您已经违反本服务协议的文字及精神，终止您的密码、帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本服务协议任何规定提供之本服务，无需进行事先通知即可中断或终止，您承认并同意，麦塔校园可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，或禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，麦塔校园对您或任何第三人均不承担任何责任。
五、知识产权和其他合法权益（包括但不限于名誉权、商誉权）
5.1　麦塔校园在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归麦塔校园所有，用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。
5.2 除另有特别声明外，麦塔校园提供本服务时所依托软件的著作权、专利权及其他知识产权均归麦塔校园所有。
5.3 麦塔校园在本服务中所使用的“麦塔校园”等商业标识，其著作权或商标权归麦塔校园所有。
5.4 上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经麦塔校园、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
六、其他
6.1　本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
6.2　如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向麦塔校园所在地的人民法院提起诉讼。
6.3　麦塔校园未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。
6.4　如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
请您在发现任何违反本服务协议以及其他任何单项服务的服务条款、麦塔校园各类公告之情形时，通知麦塔校园【电子邮箱：Lexikos_software@leedarson.com】。`;
